In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
path=r"C:\Users\Govind_Teku\Data Science\EDA\Visadataset.csv"
pd.read_csv(path)
visa_df=pd.read_csv(path)
visa_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [8]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
       'Age':[31,32,33,None],
       'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [9]:
data2.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

In [18]:
data2['Names'].fillna('Satish',inplace=True)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2  Satish  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [20]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
       'Age':[31,32,33,None],
       'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [21]:
data2.fillna(method='backfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [22]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
       'Age':[31,32,33,None],
       'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [30]:
data2.fillna(method='bfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [32]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
       'Age':[31,32,33,None],
       'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [33]:
data2.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [34]:
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [35]:
age_mean=data2['Age'].mean()
age_mean

32.0

In [37]:
data2["Age"].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [38]:
age_median=data2['Age'].median()
age_median

32.0

In [39]:
data2["Age"].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [40]:
age_mode=data2['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [41]:
data2["Age"].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

In [44]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data2[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [48]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
       'Age':[31,32,33,None],
       'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [49]:
data2["Age"].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [52]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data2[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])